# University dataset - project 2020/21

Gruppo 35: Rizzo Daniele, Salaorni Carlo e Tarli Matteo

Import of modules and reading of dataframe.

In [1]:
import pandas as pd 
import re
import numpy as np

In [2]:
times = pd.read_csv('timesData.csv', thousands=',')
shangai = pd.read_csv('shanghaiData.csv')
cwur = pd.read_csv('cwurData.csv')

In [3]:
times.head(1)

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,20152.0,8.9,25%,NaN,2011

In [4]:
shangai.head(1)

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005

In [5]:
cwur.head(1)

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.0,2012

### 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes.

Check of the years

In [6]:
newer_times = times.loc[times.groupby('university_name').year.idxmax()]
newer_times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,35569.0,17.0,1%,-,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016

In [7]:
older_times = times.loc[times.groupby('university_name').year.idxmin()]
older_times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,35569.0,17.0,1%,-,2016
501,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,-,17422.0,15.9,15%,48 : 52,2012
502,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,-,16099.0,24.2,17%,32 : 68,2012
166,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,23895.0,13.6,14%,54 : 46,2011
476,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,-,9252.0,19.2,18%,48 : 52,2012

### 2. For each university, compute the improvement in income between the least recent and the most recent data points.

In [8]:
times.groupby('year').size()

year
2011    200
2012    402
2013    400
2014    400
2015    401
2016    800
dtype: int64

We can compute the income difference only for up to 200 university. In particularly only for the 198 universities in the ranking both in 2011 and in 2016

In [9]:
len(np.intersect1d(newer_times.university_name, older_times.university_name))

818

In [10]:
merged = pd.merge(newer_times, older_times, on = 'university_name', suffixes = ('_new', '_old'))
merged.head()

,world_rank_new,university_name,country_new,teaching_new,international_new,research_new,citations_new,income_new,total_score_new,num_students_new,...,international_old,research_old,citations_old,income_old,total_score_old,num_students_old,student_staff_ratio_old,international_students_old,female_male_ratio_old,year_old
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,35569.0,...,17.9,3.7,35.7,-,-,35569.0,17.0,1%,-,2016
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,...,75.3,20.0,27.1,36.4,-,17422.0,15.9,15%,48 : 52,2012
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,...,49.0,22.2,37.5,61.9,-,16099.0,24.2,17%,32 : 68,2012
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,...,33.4,55.6,57.3,61.5,49.9,23895.0,13.6,14%,54 : 46,2011
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,...,63.8,15.5,56.6,35.5,-,9252.0,19.2,18%,48 : 52,2012

What we do now is to check if all the rows have the income values

In [11]:
clear_merged = (merged[(merged.income_new.str.contains('\d+\.\d*')) & (merged.income_old.str.contains('\d+\.\d*'))]).copy()
clear_merged.head()

,world_rank_new,university_name,country_new,teaching_new,international_new,research_new,citations_new,income_new,total_score_new,num_students_new,...,international_old,research_old,citations_old,income_old,total_score_old,num_students_old,student_staff_ratio_old,international_students_old,female_male_ratio_old,year_old
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,...,75.3,20.0,27.1,36.4,-,17422.0,15.9,15%,48 : 52,2012
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,...,49.0,22.2,37.5,61.9,-,16099.0,24.2,17%,32 : 68,2012
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,...,33.4,55.6,57.3,61.5,49.9,23895.0,13.6,14%,54 : 46,2011
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,...,63.8,15.5,56.6,35.5,-,9252.0,19.2,18%,48 : 52,2012
5,601-800,Adam Mickiewicz University,Poland,20.0,25.7,11.0,15.3,28.7,-,40633.0,...,25.7,11.0,15.3,28.7,-,40633.0,15.6,1%,71 : 29,2016

Before to compute the difference between the income we must remember to conver the series in numerical variables

In [12]:
clear_merged['income_difference'] = clear_merged['income_new'].astype('float') - clear_merged['income_old'].astype('float')
clear_merged.head()

,world_rank_new,university_name,country_new,teaching_new,international_new,research_new,citations_new,income_new,total_score_new,num_students_new,...,research_old,citations_old,income_old,total_score_old,num_students_old,student_staff_ratio_old,international_students_old,female_male_ratio_old,year_old,income_difference
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,...,20.0,27.1,36.4,-,17422.0,15.9,15%,48 : 52,2012,7.3
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,...,22.2,37.5,61.9,-,16099.0,24.2,17%,32 : 68,2012,-0.3
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,...,55.6,57.3,61.5,49.9,23895.0,13.6,14%,54 : 46,2011,6.8
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,...,15.5,56.6,35.5,-,9252.0,19.2,18%,48 : 52,2012,-4.2
5,601-800,Adam Mickiewicz University,Poland,20.0,25.7,11.0,15.3,28.7,-,40633.0,...,11.0,15.3,28.7,-,40633.0,15.6,1%,71 : 29,2016,0.0

### 3. Find the university with the largest increase computed in the previous point.

First of all let's check which universities has the best difference income

In [13]:
clear_merged.income_difference.sort_values(ascending = False).head()

428    67.8
278    59.9
230    59.6
205    59.5
276    58.3
Name: income_difference, dtype: float64

As we can see there is only one university with the mximum income difference, we can simply look for the row with that id then

In [14]:
clear_merged.loc[clear_merged['income_difference'].idxmax()]

world_rank_new                      =158
university_name               TU Dresden
country_new                      Germany
teaching_new                        41.4
international_new                   47.7
research_new                        45.8
citations_new                       66.1
income_new                          99.7
total_score_new                     52.1
num_students_new                   35487
student_staff_ratio_new             37.4
international_students_new           12%
female_male_ratio_new            42 : 58
year_new                            2016
world_rank_old                   251-275
country_old                      Germany
teaching_old                        27.3
international_old                   49.2
research_old                        13.8
citations_old                       57.4
income_old                          31.9
total_score_old                        -
num_students_old                   35487
student_staff_ratio_old             37.4
international_students_old           12%
female_male_ratio_old            42 : 58
year_old                            2012
income_difference                   67.8
Name: 428, dtype: object

### 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range.

In [15]:
times_years = set(times.year)
times_years

{2011, 2012, 2013, 2014, 2015, 2016}

In [16]:
shangai_years = set(shangai.year)
shangai_years

{2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015}

In [17]:
cwur_years = set(cwur.year)
cwur_years

{2012, 2013, 2014, 2015}

In [18]:
rank = pd.merge(times[times.year == max(times_years)].add_suffix('_times'), shangai[shangai.year == max(shangai_years)].add_suffix('_shangai'), left_on = 'university_name_times', right_on = 'university_name_shangai')
rank = rank.merge(cwur[cwur.year == max(cwur_years)].add_suffix('_cwur'), right_on = 'institution_cwur', left_on = 'university_name_times')
rank.rename({'university_name_times':'university_name'}, axis = 'columns', inplace = True)

In [19]:
rank.columns

Index(['world_rank_times', 'university_name', 'country_times',
       'teaching_times', 'international_times', 'research_times',
       'citations_times', 'income_times', 'total_score_times',
       'num_students_times', 'student_staff_ratio_times',
       'international_students_times', 'female_male_ratio_times', 'year_times',
       'world_rank_shangai', 'university_name_shangai',
       'national_rank_shangai', 'total_score_shangai', 'alumni_shangai',
       'award_shangai', 'hici_shangai', 'ns_shangai', 'pub_shangai',
       'pcp_shangai', 'year_shangai', 'world_rank_cwur', 'institution_cwur',
       'country_cwur', 'national_rank_cwur', 'quality_of_education_cwur',
       'alumni_employment_cwur', 'quality_of_faculty_cwur',
       'publications_cwur', 'influence_cwur', 'citations_cwur',
       'broad_impact_cwur', 'patents_cwur', 'score_cwur', 'year_cwur'],
      dtype='object')

In [20]:
times.world_rank = times.world_rank.str.strip('=')
times.world_rank

0             1
1             2
2             3
3             4
4             5
         ...
2598    601-800
2599    601-800
2600    601-800
2601    601-800
2602    601-800
Name: world_rank, Length: 2603, dtype: object

Let's try to fix the problem with the ranking range with new columns containing the lower bound of the ranges

In [21]:
src = re.compile('(?P<first>\d+)\s*-*\s*(?P<second>\d*)')

In [22]:
for i in range(len(rank)):
    fnd = src.search(rank.loc[i,'world_rank_shangai'])
    if fnd.group('second'): 
        rank.loc[i, 'world_rank_shangai_2'] = (int(fnd.group('first')) + int(fnd.group('second')))/2
    else:
         rank.loc[i, 'world_rank_shangai_2'] = int(fnd.group('first'))

In [23]:
for i in range(len(rank)):
    fnd = src.search(rank.loc[i,'world_rank_times'])
    if fnd.group('second'): 
        rank.loc[i, 'world_rank_times_2'] = (int(fnd.group('first')) + int(fnd.group('second')))/2
    else:
         rank.loc[i, 'world_rank_times_2'] = int(fnd.group('first'))

The ranking of cwur is already integer, no need to fix then. Here it is the slice with numerical variables we are going to use

In [24]:
rank['world_rank_cwur'].dtype

dtype('int64')

In [25]:
rank[['world_rank_times_2','world_rank_shangai_2', 'world_rank_cwur']]

     world_rank_times_2  world_rank_shangai_2  world_rank_cwur
0                   1.0                   7.0               12
1                   2.0                  10.0                5
2                   3.0                   2.0                2
3                   4.0                   5.0                4
4                   6.0                   1.0                1
..                  ...                   ...              ...
292               700.5                 450.5              245
293               700.5                 350.5              440
294               700.5                 350.5              479
295               700.5                 450.5              731
296               700.5                 250.5              768

[297 rows x 3 columns]

Now we can compute the max difference in ranking

In [26]:
for i in range(len(rank)):
    rank.loc[i,'max_diff'] = max(abs(rank.loc[i,'world_rank_times_2'] - rank.loc[i,'world_rank_shangai_2']), abs(rank.loc[i,'world_rank_times_2'] - rank.loc[i,'world_rank_cwur']), abs(rank.loc[i,'world_rank_shangai_2'] - rank.loc[i,'world_rank_cwur']))

In [27]:
rank.sort_values('max_diff', ascending = False)[['university_name','world_rank_times_2', 'world_rank_shangai_2','world_rank_cwur', 'max_diff']]

,university_name,world_rank_times_2,world_rank_shangai_2,world_rank_cwur,max_diff
162,King Abdulaziz University,275.5,175.5,995,819.5
296,University of Tehran,700.5,250.5,768,517.5
265,Keio University,550.5,350.5,34,516.5
292,Okayama University,700.5,450.5,245,455.5
288,Jilin University,700.5,250.5,391,450.0
...,...,...,...,...,...
13,University of Pennsylvania,17.0,17.0,14,3.0
6,University of Chicago,10.0,9.0,8,2.0
8,Yale University,12.0,11.0,11,1.0
3,University of Cambridge,4.0,5.0,4,1.0
2,Stanford University,3.0,2.0,2,1.0

### 5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country.

In [28]:
newer_times = times[times.year == max(times_years)].copy()

Checking if any null values is in the column of interest and eventually removal

In [29]:
newer_times.female_male_ratio.isnull().any()

True

In [30]:
newer_times.dropna(subset = ['female_male_ratio'], inplace = True)

extracting from newer_times the row with a proper ratio

In [31]:
newer_times = newer_times[newer_times['female_male_ratio'].str.contains('\d+\s*:\s*\d+')]

num_students is a numerical variables as we putted the flag thousands in the read_csv for times ranking, check it out anyway

In [32]:
newer_times['num_students'].dtype

dtype('float64')

Finally we can compute the number of male and females students using the strip function on the column with the ratio and the multiply method for pandas dataframe

In [33]:
newer_times[['female', 'male']] = round((newer_times['female_male_ratio'].str.split(' : ', expand = True).astype('int')/100).mul(newer_times['num_students'], axis = 0))

In [34]:
newer_times[['female', 'male']].sort_values('male')

        female      male
2227   17625.0       0.0
1915     129.0     333.0
2036    1401.0     418.0
1983     269.0     500.0
2037    1317.0     538.0
...        ...       ...
2259   70063.0   67315.0
2408   58618.0   68813.0
2562  128116.0   68986.0
2413  295800.0   83431.0
2430  109012.0  122929.0

[736 rows x 2 columns]

In [35]:
newer_times[['country','female', 'male']].groupby('country').sum()

                             female       male
country
Argentina                   67191.0    41182.0
Australia                  391736.0   321640.0
Austria                     68364.0    66113.0
Bangladesh                  21323.0    41393.0
Belarus                     20219.0     9084.0
...                             ...        ...
Uganda                      18670.0    18670.0
Ukraine                     17846.0    19250.0
United Arab Emirates         9516.0     4931.0
United Kingdom             711815.0   613028.0
United States of America  1597414.0  1553277.0

[70 rows x 2 columns]

### 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities).

### 7. For each country compute the fraction of students that are in one of the universities computed in the previous point.

### 8. Read the file educational_attainment_supplementary_data.csv, discarding any row without country_name or series_name.

### 9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value.

### 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

### 11. In the times ranking, compute the number of times each university appears.

### 12. Find the universities that appear at most twice in the times ranking.

### 13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).